#+latex_HEADER: \usepackage{siunitx}
#+latex_HEADER: \usepackage[version=3]{mhchem}
#+latex_HEADER: \usepackage{mathrsfs}
#+latex_HEADER: \usepackage[export]{adjustbox}
#+latex_HEADER: \usepackage{pgf,tikz}
#+latex_HEADER: \usepackage{wasysym}
#+latex_HEADER: \usetikzlibrary{arrows}
#+LATEX_HEADER: \usepackage[UTF8]{ctex}
#+LaTeX_HEADER: \usepackage{appendixnumberbeamer}
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args :noweb yes
#+sTARTUP: beamer

** TOLA 射电干涉的模拟
   #+BEGIN_SRC dot :file ./TOLA-pipeline.pdf :cmdline -Kdot -Tpdf
     digraph dataset {
     bgcolor="#ffffff00"

     S [label = "i (1..N) 射电源的\n 方向、频率、振幅", shape=box]
     B [label = "j (1..M) 基站\n 位置", shape=box]
     P [label = "i 射电源在 j 基站上\n诱导的信号"]
     Q [label = "j 基站上\n接收的总信号"]

     S -> P
     B -> P
     P -> Q[label="线性相加"]

     O [label = "时钟偏移的\n高斯分布标准差", shape=box]
     F [label = "j 基站的时钟偏移", shape=box]
     O -> F [label = "抽样"]
     F -> Q
     }
   #+END_SRC

   #+RESULTS:
   #+Attr_LaTeX: :height 0.7\textheight
   [[file:./TOLA-pipeline.pdf]]
   
